# Pandas 更改列名，更改列序，按某列排序
---
### 载入文件

In [5]:
import pandas as pd

data = {"NAME":["yahoo","google","facebook"], 
        "MARKS":[200,400,800], 
        "PRICE":[9, 3, 7]} 
df = pd.DataFrame(data) 
df

   MARKS      NAME  PRICE
0    200     yahoo      9
1    400    google      3
2    800  facebook      7

---
### 修改列名

In [5]:
columns = ['marks','name','price']
df.columns = columns #该方式只是把列名改了，而没有重新排列的顺序
df

   marks      name  price
0    200     yahoo      9
1    400    google      3
2    800  facebook      7

---
### 改变列的顺序

In [6]:
columns = ['name','marks','price']
# df = df.reindex_axis(columns, axis=1) 新版本中即将被舍弃
# df = df[columns] 比较有效但不那么优雅
df = df.reindex(columns = columns)
df

       name  marks  price
0     yahoo    200      9
1    google    400      3
2  facebook    800      7

---
### 按某列重新排序

In [32]:
df = df.sort_values(by = 'price') # 索引变乱
df

       name  marks  price
1    google    400      3
2  facebook    800      7
0     yahoo    200      9

In [33]:
df = df.reset_index(drop=True)  # 重置索引
df

       name  marks  price
0    google    400      3
1  facebook    800      7
2     yahoo    200      9